Tutorials/Case7/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          249000;
        startFace       248251;
    }
    inlet
    {
        type            patch;
        nFaces          249;
        startFace       497251;
    }
    outlet
    {
        type            patch;
        nFaces          249;
        startFace       497500;
    }
    topandbottom
    {
        type            patch;
        nFaces          1000;
        startFace       497749;
    }
)

// ************************************************************************* //
